app/Services/AlerteService.php

    public function getTransactionsFraisZero(int $joursRecent = 7): array
    {
        $dateDebut = date('Y-m-d', strtotime("-$joursRecent days"));

        return $this->transactionModel
            ->select('transactions.*, types_operation.libelle as type_libelle, clients.nom, clients.telephone')
            ->join('types_operation', 'types_operation.id = transactions.type_operation_id')
            ->join('clients', 'clients.id = transactions.client_id')
            ->where('transactions.frais', 0)
            ->where('transactions.montant >', 0)
            ->where('transactions.date_creation >=', $dateDebut)
            ->orderBy('transactions.date_creation', 'DESC')
            ->findAll();
---
SELECT `transactions`.*, `types_operation`.`libelle` as `type_libelle`, `clients`.`nom`, `clients`.`telephone`
FROM `transactions`
JOIN `types_operation` ON `types_operation`.`id` = `transactions`.`type_operation_id`
JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
WHERE `transactions`.`frais` = 0
AND `transactions`.`montant` > 0
AND `transactions`.`date_creation` >= '2026-07-14'
ORDER BY `transactions`.`date_creation` DESC

    public function getComptesSoldeEleve(float $seuil = 1000000): array
    {
        return $this->compteModel
            ->select('comptes.*, clients.nom, clients.telephone')
            ->join('clients', 'clients.id = comptes.client_id')
            ->where('comptes.solde >', $seuil)
            ->orderBy('comptes.solde', 'DESC')
            ->findAll();
---
SELECT `comptes`.*, `clients`.`nom`, `clients`.`telephone`
FROM `comptes`
JOIN `clients` ON `clients`.`id` = `comptes`.`client_id`
WHERE `comptes`.`solde` > 1000000
ORDER BY `comptes`.`solde` DESC

    public function getPrefixesInactifsAvecClients(): array
    {
        return $this->prefixeModel
            ->select('prefixes.*, COUNT(clients.id) as nb_clients')
            ->join('clients', 'clients.prefixe_id = prefixes.id')
            ->where('prefixes.actif', 0)
            ->groupBy('prefixes.id')
            ->having('nb_clients >', 0)
            ->findAll();
---
SELECT `prefixes`.*, COUNT(clients.id) as nb_clients
FROM `prefixes`
JOIN `clients` ON `clients`.`prefixe_id` = `prefixes`.`id`
WHERE `prefixes`.`actif` = 0
GROUP BY `prefixes`.`id`
HAVING `nb_clients` > 0

    public function getInactivitePlateforme(int $seuilJours = 2): ?int
    {
        $derniere = $this->transactionModel
            ->orderBy('date_creation', 'DESC')
            ->first();
---
SELECT *
FROM `transactions`
ORDER BY `date_creation` DESC
 LIMIT 1