app/Services/ClientAuthService.php

SELECT *
FROM `clients`
WHERE `telephone` = '0331234567'
 LIMIT 1
---
    public function attempt(string $telephone): ?array
    {
        return $this->clientModel->where('telephone', $telephone)->first();