app/Services/DepotService.php

    public function effectuer(int $clientId, float $montant): array
    {
        if ($montant <= 0) {
            return ['success' => false, 'message' => 'Montant invalide.'];
        }

        $typeDepot = $this->typeOperationModel->where('libelle', 'depot')->first();

        if (! $typeDepot) {
            return ['success' => false, 'message' => "Type d'opération 'depot' introuvable."];
        }

        $frais = $this->baremeModel->getFrais($typeDepot['id'], $montant);

        $compte = $this->compteModel->where('client_id', $clientId)->first();

        if (! $compte) {
            return ['success' => false, 'message' => 'Compte introuvable.'];
        }

        $db = \Config\Database::connect();
        $db->transStart(); //transaction SQL

        // Crédite le solde du montant complet (frais = revenu opérateur, non déduit)
        $this->compteModel->update($compte['id'], [
            'solde' => $compte['solde'] + $montant,
        ]);

        $this->transactionModel->insert([
            'client_id'              => $clientId,
            'client_destinataire_id' => null,
            'type_operation_id'      => $typeDepot['id'],
            'montant'                => $montant,
            'frais'                  => $frais,
            'date_creation'          => date('Y-m-d H:i:s'),
        ]);
---
SELECT *
FROM `comptes`
WHERE `client_id` = 1
 LIMIT 1
UPDATE `comptes` SET `solde` = 15900
WHERE `comptes`.`id` IN ('1')
INSERT INTO `transactions` (`client_id`, `client_destinataire_id`, `type_operation_id`, `montant`, `frais`, `date_creation`) VALUES (1, NULL, '1', 2000, 50, '2026-07-20 09:47:05')