app/Services/OperateurAuthService.php

SELECT *
FROM `operateurs`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function attempt(string $username, string $password): ?array
    {
        $operateur = $this->operateurModel->where('username', $username)->first();