app/Services/TransfertService.php

SELECT *
FROM `comptes`
WHERE `client_id` = '6'
 LIMIT 1
---
            $commissionExterne = round($montant * ($pourcentage / 100), 2);
        }

        $compteEmetteur     = $this->compteModel->where('client_id', $clientId)->first();

UPDATE `comptes` SET `solde` = 3200
WHERE `comptes`.`id` IN ('6')
---
        $db = \Config\Database::connect();
        $db->transStart();

        $this->compteModel->update($compteEmetteur['id'], [
            'solde' => $compteEmetteur['solde'] - $totalADeduire,
        ]);

INSERT INTO `transactions` (`client_id`, `client_destinataire_id`, `type_operation_id`, `montant`, `frais`, `commission_externe`, `date_creation`) VALUES (1, '6', '3', 200, 50, 20, '2026-07-21 06:42:03')
---
            'solde' => $compteDestinataire['solde'] + $montantCredite,
        ]);

        $this->transactionModel->insert([
            'client_id'              => $clientId,
            'client_destinataire_id' => $destinataire['id'],
            'type_operation_id'      => $typeTransfert['id'],
            'montant'                => $montant,
            'frais'                  => $fraisTransfert,
            'commission_externe'     => $commissionExterne,
            'date_creation'          => date('Y-m-d H:i:s'),
        ]);