app/Services/TransfertMultipleService.php

    public function effectuer(int $clientId, array $telephones, float $montantTotal): array
    {
        $telephones = array_values(array_unique(array_filter(array_map('trim', $telephones))));

        if (count($telephones) < 2) {
            return ['success' => false, 'message' => 'Il faut au moins 2 destinataires.'];
        }

        if ($montantTotal <= 0) {
            return ['success' => false, 'message' => 'Montant total invalide.'];
        }

        $emetteur = $this->clientModel->find($clientId);
        $prefixeEmetteur = $emetteur['prefixe_id'] ?? null;

        $typeTransfert = $this->typeOperationModel->where('libelle', 'transfert')->first();
        if (! $typeTransfert) {
            return ['success' => false, 'message' => "Type d'opération introuvable."];
        }

        $nbDestinataires = count($telephones);
        $montantParPersonne = round($montantTotal / $nbDestinataires, 2);

        $destinataires = [];

        // Validation de tous les destinataires AVANT toute écriture
        foreach ($telephones as $tel) {
            $client = $this->clientModel->where('telephone', $tel)->first();
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
SELECT *
FROM `clients`
WHERE `telephone` = '0331111111'
 LIMIT 1

                return ['success' => false, 'message' => "Le destinataire $tel n'est pas un numéro interne."];
            }

            $compte = $this->compteModel->where('client_id', $client['id'])->first();
---
SELECT *
FROM `comptes`
WHERE `client_id` = '2'
 LIMIT 1

            $destinataires
        ));

        $compteEmetteur = $this->compteModel->where('client_id', $clientId)->first();
---
SELECT *
FROM `comptes`
WHERE `client_id` = 1
 LIMIT 1

        $db->transStart();

        // Debit unique de l'emetteur
        $this->compteModel->update($compteEmetteur['id'], [
            'solde' => $compteEmetteur['solde'] - $totalADeduire,
        ]);

        // Credit + transaction pour chaque destinataire
        foreach ($destinataires as $d) {
            $this->compteModel->update($d['compte']['id'], [
                'solde' => $d['compte']['solde'] + $montantParPersonne,
            ]);

            $this->transactionModel->insert([
                'client_id'              => $clientId,
                'client_destinataire_id' => $d['client']['id'],
                'type_operation_id'      => $typeTransfert['id'],
                'montant'                => $montantParPersonne,
                'frais'                  => $d['frais'],
                'date_creation'          => date('Y-m-d H:i:s'),
            ]);
---
UPDATE `comptes` SET `solde` = 4900
WHERE `comptes`.`id` IN ('1')
UPDATE `comptes` SET `solde` = 26200
WHERE `comptes`.`id` IN ('2')
INSERT INTO `transactions` (`client_id`, `client_destinataire_id`, `type_operation_id`, `montant`, `frais`, `date_creation`) VALUES (1, '2', '3', 500, 50, '2026-07-20 13:50:24')