app/Controllers/Client/DashboardController.php

    public function index()
    {
        $clientId = session()->get('client_id');

        $compteModel = new CompteModel();
        $compte = $compteModel->where('client_id', $clientId)->first();
---
SELECT *
FROM `comptes`
WHERE `client_id` = '1'
 LIMIT 1