app/Controllers/Operateur/PrefixeController.php

    public function index()
    {
        $data = [
            'prefixes' => $this->prefixeModel->findAll(),
            'operateur_username' => session()->get('operateur_username'),
        ];
---
SELECT *
FROM `prefixes`