app/Controllers/Operateur/SituationController.php

SELECT `types_operation`.`libelle`, COUNT(transactions.id) AS nb, SUM(transactions.frais) AS total_frais
FROM `transactions`
JOIN `types_operation` ON `types_operation`.`id` = `transactions`.`type_operation_id`
GROUP BY `types_operation`.`id`
SELECT `prefixes`.`code`, SUM(transactions.commission_externe) AS total_du
FROM `transactions`
JOIN `clients` ON `clients`.`id` = `transactions`.`client_destinataire_id`
JOIN `prefixes` ON `prefixes`.`id` = `clients`.`prefixe_id`
WHERE `transactions`.`commission_externe` > 0
GROUP BY `prefixes`.`id`
---
    public function gains()
{
        $gains = $this->transactionModel
            ->select('types_operation.libelle, COUNT(transactions.id) AS nb, SUM(transactions.frais) AS total_frais')
            ->join('types_operation', 'types_operation.id = transactions.type_operation_id')
            ->groupBy('types_operation.id')
            ->findAll();

        $montants_dus = $this->transactionModel
       ->select('prefixes.code, SUM(transactions.commission_externe) AS total_du')
       ->join('clients', 'clients.id = transactions.client_destinataire_id')
       ->join('prefixes', 'prefixes.id = clients.prefixe_id')
       ->where('transactions.commission_externe >', 0)
       ->groupBy('prefixes.id')
       ->findAll();

SELECT `clients`.`telephone`, `clients`.`nom`, `comptes`.`solde`
FROM `comptes`
JOIN `clients` ON `clients`.`id` = `comptes`.`client_id`
---
    public function comptes()
    {

           $data = $this->compteModel
               ->select('clients.telephone, clients.nom, comptes.solde')
               ->join('clients', 'clients.id = comptes.client_id')
               ->findAll();