app/Controllers/Operateur/TypeBaremeController.php

    public function index()
    {
        $types = $this->typeModel->findAll();
        foreach ($types as &$type) {
            $type['baremes'] = $this->baremeModel->where('type_operation_id', $type['id'])->findAll();
---
SELECT *
FROM `baremes`
WHERE `type_operation_id` = '1'