app/Models/BaremeModel.php

    public function getFrais(int $typeOperationId, float $montant): float
    {
        $bareme = $this->where('type_operation_id', $typeOperationId)
                        ->where('montant_min <=', $montant)
                        ->where('montant_max >=', $montant)
                        ->first();
---
SELECT *
FROM `baremes`
WHERE `type_operation_id` = 3
AND `montant_min` <= 200
AND `montant_max` >= 200
 LIMIT 1