app/Models/ClientModel.php

SELECT `clients`.*, `prefixes`.`est_interne`
FROM `clients`
JOIN `prefixes` ON `prefixes`.`id` = `clients`.`prefixe_id`
WHERE `clients`.`telephone` = '0324444444'
 LIMIT 1
---
    public function findWithPrefixe(string $telephone): ?array
    {
        return $this->select('clients.*, prefixes.est_interne')
                    ->join('prefixes', 'prefixes.id = clients.prefixe_id')
                    ->where('clients.telephone', $telephone)
                    ->first();

SELECT COUNT(DISTINCT client_id) as total
FROM `transactions`
WHERE `date_creation` >= '2026-07-01'
---
    public function getClientsActifsCeMois(): int
{
    $debutMois = date('Y-m-01');

    $db = \Config\Database::connect();
    $result = $db->table('transactions')
                 ->select('COUNT(DISTINCT client_id) as total')
                 ->where('date_creation >=', $debutMois)
                 ->get()
                 ->getRowArray();