app/Models/ClientModel.php

SELECT COUNT(DISTINCT client_id) as total
FROM `transactions`
WHERE `date_creation` >= '2026-07-01'
---
    public function getClientsActifsCeMois(): int
{
    $debutMois = date('Y-m-01');

    $db = \Config\Database::connect();
    $result = $db->table('transactions')
                 ->select('COUNT(DISTINCT client_id) as total')
                 ->where('date_creation >=', $debutMois)
                 ->get()
                 ->getRowArray();