app/Models/CommissionConfigModel.php

SELECT *
FROM `commission_config`
ORDER BY `date_creation` DESC
 LIMIT 1
---
    public function getPourcentageActuel(): float
    {
        $config = $this->orderBy('date_creation', 'DESC')->first();