app/Models/CompteModel.php

SELECT SUM(`solde`) AS `solde`
FROM `comptes`
 LIMIT 1
---
    public function getSoldeTotalCirculation(): float
{
    $result = $this->selectSum('solde')->first();