app/Models/TransactionModel.php

    public function getHistoriqueClient(int $clientId): array
    {
        return $this->select('transactions.*, types_operation.libelle as type_libelle')
                    ->join('types_operation', 'types_operation.id = transactions.type_operation_id')
                    ->where('transactions.client_id', $clientId)
                    ->orderBy('transactions.date_creation', 'DESC')
                    ->findAll();
---
SELECT `transactions`.*, `types_operation`.`libelle` as `type_libelle`
FROM `transactions`
JOIN `types_operation` ON `types_operation`.`id` = `transactions`.`type_operation_id`
WHERE `transactions`.`client_id` = 1
ORDER BY `transactions`.`date_creation` DESC

    public function getRepartitionParType(int $clientId): array
    {
        return $this->select('types_operation.libelle, COUNT(transactions.id) as total')
                    ->join('types_operation', 'types_operation.id = transactions.type_operation_id')
                    ->where('transactions.client_id', $clientId)
                    ->groupBy('types_operation.libelle')
                    ->findAll();
---
SELECT `types_operation`.`libelle`, COUNT(transactions.id) as total
FROM `transactions`
JOIN `types_operation` ON `types_operation`.`id` = `transactions`.`type_operation_id`
WHERE `transactions`.`client_id` = 1
GROUP BY `types_operation`.`libelle`

    public function getEvolutionSolde(int $clientId): array
    {
        $transactions = $this->select('transactions.*, types_operation.libelle as type_libelle')
                            ->join('types_operation', 'types_operation.id = transactions.type_operation_id')
                            ->groupStart()
                                ->where('transactions.client_id', $clientId)
                                ->orWhere('transactions.client_destinataire_id', $clientId)
                            ->groupEnd()
                            ->orderBy('transactions.date_creation', 'ASC')
                            ->findAll();
---
SELECT `transactions`.*, `types_operation`.`libelle` as `type_libelle`
FROM `transactions`
JOIN `types_operation` ON `types_operation`.`id` = `transactions`.`type_operation_id`
WHERE   (
`transactions`.`client_id` = 1
OR `transactions`.`client_destinataire_id` = 1
 )
ORDER BY `transactions`.`date_creation` ASC

    public function getVolumeTransactions(): array
{
    $aujourdhui = $this->where('DATE(date_creation)', date('Y-m-d'))->countAllResults();

    $debutSemaine = date('Y-m-d', strtotime('monday this week'));
    $cetteSemaine = $this->where('date_creation >=', $debutSemaine)->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE DATE(date_creation) = '2026-07-21'
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `date_creation` >= '2026-07-20'

public function getMontantTotal(): float
{
    $result = $this->selectSum('montant')->first();
---
SELECT SUM(`montant`) AS `montant`
FROM `transactions`
 LIMIT 1

public function getGainsBruts(): float
{
    $result = $this->selectSum('frais')->first();
---
SELECT SUM(`frais`) AS `frais`
FROM `transactions`
 LIMIT 1

public function getEvolutionGains(int $nbJours = 7): array
{
    $dateDebut = date('Y-m-d', strtotime("-$nbJours days"));

    return $this->select('DATE(date_creation) as jour, SUM(frais) as total_frais')
                ->where('date_creation >=', $dateDebut)
                ->groupBy('jour')
                ->orderBy('jour', 'ASC')
                ->findAll();
---
SELECT DATE(date_creation) as jour, SUM(frais) as total_frais
FROM `transactions`
WHERE `date_creation` >= '2026-07-14'
GROUP BY `jour`
ORDER BY `jour` ASC

public function getRepartitionOperations(): array
{
    return $this->select('types_operation.libelle, COUNT(transactions.id) as nombre, SUM(transactions.montant) as volume')
                ->join('types_operation', 'types_operation.id = transactions.type_operation_id')
                ->groupBy('types_operation.libelle')
                ->findAll();
---
SELECT `types_operation`.`libelle`, COUNT(transactions.id) as nombre, SUM(transactions.montant) as volume
FROM `transactions`
JOIN `types_operation` ON `types_operation`.`id` = `transactions`.`type_operation_id`
GROUP BY `types_operation`.`libelle`

public function getTopPrefixes(int $limite = 5): array
{
    return $this->select('prefixes.code, COUNT(transactions.id) as nombre')
                ->join('clients', 'clients.id = transactions.client_id')
                ->join('prefixes', 'prefixes.id = clients.prefixe_id')
                ->groupBy('prefixes.code')
                ->orderBy('nombre', 'DESC')
                ->limit($limite)
                ->findAll();
---
SELECT `prefixes`.`code`, COUNT(transactions.id) as nombre
FROM `transactions`
JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
JOIN `prefixes` ON `prefixes`.`id` = `clients`.`prefixe_id`
GROUP BY `prefixes`.`code`
ORDER BY `nombre` DESC
 LIMIT 5

public function getTopClients(int $limite = 5): array
{
    return $this->select('clients.nom, clients.telephone, SUM(transactions.montant) as volume')
                ->join('clients', 'clients.id = transactions.client_id')
                ->groupBy('clients.id')
                ->orderBy('volume', 'DESC')
                ->limit($limite)
                ->findAll();
---
SELECT `clients`.`nom`, `clients`.`telephone`, SUM(transactions.montant) as volume
FROM `transactions`
JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
GROUP BY `clients`.`id`
ORDER BY `volume` DESC
 LIMIT 5